hotchk155/matrix-seq-firmware/MatrixSeq/board/pin_mux.h
/*! @name PTB2 (number 22), P_ASCK
  @{ */
#define BOARD_INITPINS_P_ASCK_PERIPHERAL GPIOA /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_P_ASCK_SIGNAL GPIO      /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_P_ASCK_GPIO GPIOA       /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_P_ASCK_GPIO_PIN 10U     /*!<@brief PORTA pin index: 10 */
#define BOARD_INITPINS_P_ASCK_PORT PORTB       /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_P_ASCK_PIN 2U           /*!<@brief PORTB pin index: 2 */
#define BOARD_INITPINS_P_ASCK_CHANNEL 10       /*!<@brief GPIOA GPIO channel: 10 */
#define BOARD_INITPINS_P_ASCK_PIN_NAME PTB2    /*!<@brief Pin name */
#define BOARD_INITPINS_P_ASCK_LABEL "P_ASCK"   /*!<@brief Label */
#define BOARD_INITPINS_P_ASCK_NAME "P_ASCK"    /*!<@brief Identifier name */
                                               /* @} */

/*! @name PTB3 (number 21), P_ADAT
  @{ */
#define BOARD_INITPINS_P_ADAT_PERIPHERAL GPIOA /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_P_ADAT_SIGNAL GPIO      /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_P_ADAT_GPIO GPIOA       /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_P_ADAT_GPIO_PIN 11U     /*!<@brief PORTA pin index: 11 */
#define BOARD_INITPINS_P_ADAT_PORT PORTB       /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_P_ADAT_PIN 3U           /*!<@brief PORTB pin index: 3 */
#define BOARD_INITPINS_P_ADAT_CHANNEL 11       /*!<@brief GPIOA GPIO channel: 11 */
#define BOARD_INITPINS_P_ADAT_PIN_NAME PTB3    /*!<@brief Pin name */
#define BOARD_INITPINS_P_ADAT_LABEL "P_ADAT"   /*!<@brief Label */
#define BOARD_INITPINS_P_ADAT_NAME "P_ADAT"    /*!<@brief Identifier name */
                                               /* @} */

/*! @name PTC6 (number 37), KEYSCAN1
  @{ */
#define BOARD_INITPINS_KEYSCAN1_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_KEYSCAN1_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_KEYSCAN1_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_KEYSCAN1_GPIO_PIN 22U                      /*!<@brief PORTA pin index: 22 */
#define BOARD_INITPINS_KEYSCAN1_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_KEYSCAN1_PIN 6U                            /*!<@brief PORTC pin index: 6 */
#define BOARD_INITPINS_KEYSCAN1_CHANNEL 22                        /*!<@brief GPIOA GPIO channel: 22 */
#define BOARD_INITPINS_KEYSCAN1_PIN_NAME PTC6                     /*!<@brief Pin name */
#define BOARD_INITPINS_KEYSCAN1_LABEL "KEYSCAN1"                  /*!<@brief Label */
#define BOARD_INITPINS_KEYSCAN1_NAME "KEYSCAN1"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_KEYSCAN1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PTD6 (number 17), KEYSCAN3
  @{ */
#define BOARD_INITPINS_KEYSCAN3_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_KEYSCAN3_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_KEYSCAN3_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_KEYSCAN3_GPIO_PIN 30U                      /*!<@brief PORTA pin index: 30 */
#define BOARD_INITPINS_KEYSCAN3_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_KEYSCAN3_PIN 6U                            /*!<@brief PORTD pin index: 6 */
#define BOARD_INITPINS_KEYSCAN3_CHANNEL 30                        /*!<@brief GPIOA GPIO channel: 30 */
#define BOARD_INITPINS_KEYSCAN3_PIN_NAME PTD6                     /*!<@brief Pin name */
#define BOARD_INITPINS_KEYSCAN3_LABEL "KEYSCAN3"                  /*!<@brief Label */
#define BOARD_INITPINS_KEYSCAN3_NAME "KEYSCAN3"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_KEYSCAN3_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PTD7 (number 16), KEYSCAN2
  @{ */
#define BOARD_INITPINS_KEYSCAN2_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_KEYSCAN2_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_KEYSCAN2_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_KEYSCAN2_GPIO_PIN 31U                      /*!<@brief PORTA pin index: 31 */
#define BOARD_INITPINS_KEYSCAN2_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_KEYSCAN2_PIN 7U                            /*!<@brief PORTD pin index: 7 */
#define BOARD_INITPINS_KEYSCAN2_CHANNEL 31                        /*!<@brief GPIOA GPIO channel: 31 */
#define BOARD_INITPINS_KEYSCAN2_PIN_NAME PTD7                     /*!<@brief Pin name */
#define BOARD_INITPINS_KEYSCAN2_LABEL "KEYSCAN2"                  /*!<@brief Label */
#define BOARD_INITPINS_KEYSCAN2_NAME "KEYSCAN2"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_KEYSCAN2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PTD0 (number 2), ENCODER2
  @{ */
#define BOARD_INITPINS_ENCODER2_PERIPHERAL GPIOA /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_ENCODER2_SIGNAL GPIO      /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_ENCODER2_GPIO GPIOA       /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_ENCODER2_GPIO_PIN 24U     /*!<@brief PORTA pin index: 24 */
#define BOARD_INITPINS_ENCODER2_PORT PORTD       /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_ENCODER2_PIN 0U           /*!<@brief PORTD pin index: 0 */
#define BOARD_INITPINS_ENCODER2_CHANNEL 24       /*!<@brief GPIOA GPIO channel: 24 */
#define BOARD_INITPINS_ENCODER2_PIN_NAME PTD0    /*!<@brief Pin name */
#define BOARD_INITPINS_ENCODER2_LABEL "ENCODER2" /*!<@brief Label */
#define BOARD_INITPINS_ENCODER2_NAME "ENCODER2"  /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PTD1 (number 1), ENCODER1
  @{ */
#define BOARD_INITPINS_ENCODER1_PERIPHERAL GPIOA /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_ENCODER1_SIGNAL GPIO      /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_ENCODER1_GPIO GPIOA       /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_ENCODER1_GPIO_PIN 25U     /*!<@brief PORTA pin index: 25 */
#define BOARD_INITPINS_ENCODER1_PORT PORTD       /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_ENCODER1_PIN 1U           /*!<@brief PORTD pin index: 1 */
#define BOARD_INITPINS_ENCODER1_CHANNEL 25       /*!<@brief GPIOA GPIO channel: 25 */
#define BOARD_INITPINS_ENCODER1_PIN_NAME PTD1    /*!<@brief Pin name */
#define BOARD_INITPINS_ENCODER1_LABEL "ENCODER1" /*!<@brief Label */
#define BOARD_INITPINS_ENCODER1_NAME "ENCODER1"  /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PTA6 (number 26), GATEOUT4
  @{ */
#define BOARD_INITPINS_GATEOUT4_PERIPHERAL GPIOA /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_GATEOUT4_SIGNAL GPIO      /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_GATEOUT4_GPIO GPIOA       /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_GATEOUT4_GPIO_PIN 6U      /*!<@brief PORTA pin index: 6 */
#define BOARD_INITPINS_GATEOUT4_PORT PORTA       /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_GATEOUT4_PIN 6U           /*!<@brief PORTA pin index: 6 */
#define BOARD_INITPINS_GATEOUT4_CHANNEL 6        /*!<@brief GPIOA GPIO channel: 6 */
#define BOARD_INITPINS_GATEOUT4_PIN_NAME PTA6    /*!<@brief Pin name */
#define BOARD_INITPINS_GATEOUT4_LABEL "GATEOUT4" /*!<@brief Label */
#define BOARD_INITPINS_GATEOUT4_NAME "GATEOUT4"  /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PTD2 (number 31), GATEOUT1
  @{ */
#define BOARD_INITPINS_GATEOUT1_PERIPHERAL GPIOA /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_GATEOUT1_SIGNAL GPIO      /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_GATEOUT1_GPIO GPIOA       /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_GATEOUT1_GPIO_PIN 26U     /*!<@brief PORTA pin index: 26 */
#define BOARD_INITPINS_GATEOUT1_PORT PORTD       /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_GATEOUT1_PIN 2U           /*!<@brief PORTD pin index: 2 */
#define BOARD_INITPINS_GATEOUT1_CHANNEL 26       /*!<@brief GPIOA GPIO channel: 26 */
#define BOARD_INITPINS_GATEOUT1_PIN_NAME PTD2    /*!<@brief Pin name */
#define BOARD_INITPINS_GATEOUT1_LABEL "GATEOUT1" /*!<@brief Label */
#define BOARD_INITPINS_GATEOUT1_NAME "GATEOUT1"  /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PTD3 (number 30), GATEOUT2
  @{ */
#define BOARD_INITPINS_GATEOUT2_PERIPHERAL GPIOA /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_GATEOUT2_SIGNAL GPIO      /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_GATEOUT2_GPIO GPIOA       /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_GATEOUT2_GPIO_PIN 27U     /*!<@brief PORTA pin index: 27 */
#define BOARD_INITPINS_GATEOUT2_PORT PORTD       /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_GATEOUT2_PIN 3U           /*!<@brief PORTD pin index: 3 */
#define BOARD_INITPINS_GATEOUT2_CHANNEL 27       /*!<@brief GPIOA GPIO channel: 27 */
#define BOARD_INITPINS_GATEOUT2_PIN_NAME PTD3    /*!<@brief Pin name */
#define BOARD_INITPINS_GATEOUT2_LABEL "GATEOUT2" /*!<@brief Label */
#define BOARD_INITPINS_GATEOUT2_NAME "GATEOUT2"  /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PTD4 (number 29), GATEOUT3
  @{ */
#define BOARD_INITPINS_GATEOUT3_PERIPHERAL GPIOA /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_GATEOUT3_SIGNAL GPIO      /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_GATEOUT3_GPIO GPIOA       /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_GATEOUT3_GPIO_PIN 28U     /*!<@brief PORTA pin index: 28 */
#define BOARD_INITPINS_GATEOUT3_PORT PORTD       /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_GATEOUT3_PIN 4U           /*!<@brief PORTD pin index: 4 */
#define BOARD_INITPINS_GATEOUT3_CHANNEL 28       /*!<@brief GPIOA GPIO channel: 28 */
#define BOARD_INITPINS_GATEOUT3_PIN_NAME PTD4    /*!<@brief Pin name */
#define BOARD_INITPINS_GATEOUT3_LABEL "GATEOUT3" /*!<@brief Label */
#define BOARD_INITPINS_GATEOUT3_NAME "GATEOUT3"  /*!<@brief Identifier name */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
